package com.tm.consts.error;

/**
 * エラーコード定数クラス。
 */
public enum TaskManagerErrorCode {

	//------------------------------------
	// 1. 利用者データ系
	//------------------------------------

    //-----------利用者ID-----------//

    /**
     * 入力されていること
     */
    ERR110001("ERR110001"),

    /**
     * 半角英数字であること
     */
    ERR110002("ERR110002"),

    /**
     * 10桁であること
     */
    ERR110003("ERR110003"),

    ERR120001("ERR120001"),
    ERR120002("ERR120002"),
    ERR120003("ERR120003"),

    ERR130001("ERR130001"),
    ERR130002("ERR130002"),
    ERR130003("ERR130003"),
    ERR130004("ERR130004"),

    ERR140001("ERR140001"),
    ERR140002("ERR140002"),

    ERR150001("ERR150001"),
    ERR150002("ERR150002"),
    ERR150003("ERR150003"),

    //------------------------------------
    // 2. タスクデータ系
    //------------------------------------

    /**
     * タスクID、入力されていること
     */
    ERR210001("ERR210001"),

    /**
     * タスクID、半角英数字であること
     */
    ERR210002("ERR210002"),

    /**
     * タスクID、10桁であること
     */
    ERR210003("ERR210003"),

    ERR220001("ERR220001"),
    ERR220002("ERR220002"),
    ERR220003("ERR220003"),

    ERR230001("ERR230001"),
    ERR230002("ERR230002"),

    ERR240001("ERR240001"),
    ERR240002("ERR240002"),

    ERR250001("ERR250001"),
    ERR250002("ERR250002"),
    ERR250003("ERR250003"),

    ERR260001("ERR260001"),
    ERR260002("ERR260002"),

    ERR270001("ERR270001"),
    ERR270002("ERR270002"),
    ERR270003("ERR270003"),

    //------------------------------------
    // 9. 共通仕様系
    //------------------------------------

    /**
     * 業務エラー、リクエストオブジェクトが空でないこと
     */
    ERR910001("ERR910001"),

    /**
     * システムエラー、対応していないHTTPメソッド
     */
    ERR990001("ERR990001"),

    /**
     * リクエストのJavaオブジェクトマッピング失敗
     */
    ERR990002("ERR990002"),

    /**
     * システムエラー、内部サーバエラー
     */
    ERR999999("ERR999999");


	private final String code;

	/**
	 * デフォルトコンストラクタ。不可視。
	 * @param code エラーコード
	 */
    private TaskManagerErrorCode(final String code) {
        this.code = code;
    }
    public String getCode() {
        return code;
    }

}
